In [59]:
import pandas as pd

In [60]:
dados = {
    "nome": ['Alice', 'Bob', 'Carlos'],
    'Idade': [25, 30, 35],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte']
}
dataFrame= pd.DataFrame(dados)
dataFrame

     nome  Idade          Cidade
0   Alice     25       São Paulo
1     Bob     30  Rio de Janeiro
2  Carlos     35  Belo Horizonte

In [61]:
#Exibir o primeiro elemento
dataFrame.head(1)

    nome  Idade     Cidade
0  Alice     25  São Paulo

In [62]:
dados_notas_disciplinas = {
    "nome": ['Alice', 'Bob', 'Carlos'],
    "Matematica" : [8.5, 9.0, 8.8],
    "Fisica": [8.8, 5.0, 9.0],
    "Quimica": [7.8, 8.8, 9.8]  
}

In [63]:
df_notas = pd.DataFrame(dados_notas_disciplinas)
df_notas

     nome  Matematica  Fisica  Quimica
0   Alice         8.5     8.8      7.8
1     Bob         9.0     5.0      8.8
2  Carlos         8.8     9.0      9.8

Calcular a média das notas por aluno 
A primeira lista, informada como parâmetros, entre colchetes duplos, diz respeito as colunas do dataframe que serão consideradas no cálculo da média. Lembrando tais colunas são as chaves do dicionario que foi na criação do dataframe.

mean(axis=1), significa:
O eixo 0 atuará em todas as LINHAS em cada COLUNA:
O eixo 1 atuará em todas as COLUNA em cada LINHA:
Portanto, uma média no eixo 0 será a média de todas as linhas em cada coluna, e uma média no eixo 1 será a média de todas as colunas em cada linha.

In [64]:
df_notas["Media"] = df_notas[["Matematica", "Fisica", "Quimica"]].mean(axis=1)
df_notas

     nome  Matematica  Fisica  Quimica     Media
0   Alice         8.5     8.8      7.8  8.366667
1     Bob         9.0     5.0      8.8  7.600000
2  Carlos         8.8     9.0      9.8  9.200000

In [65]:
notas_acima_da_media = df_notas[df_notas["Media"] >= 6 ]
notas_acima_da_media[["nome", "Media"]]

     nome     Media
0   Alice  8.366667
1     Bob  7.600000
2  Carlos  9.200000